In [1]:
import numpy as np
import pandas as pd

In [2]:
col1 = [1, 2, 3, 4]
col2 = [444, 555, 666, 444]
col3 = ['abc', 'def', 'ghi', 'xyz']

In [4]:
df = pd.DataFrame(data = {'col1': col1, 'col2': col2, 'col3': col3})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Seleção de dados unicos

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
np.unique(df['col2'])

array([444, 555, 666])

In [7]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Aplicando uma função no pandas

In [11]:
df['col1'].apply( lambda x : x ** 2 )

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

# Deletando colunas

In [12]:
del df['col3']

In [13]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

# Acessando informações da coluna e indice

In [14]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Ordenar valores do dataframe

In [19]:
df.sort_values( by = 'col2', inplace = True)
df

   col1  col2
0     1   444
3     4   444
1     2   555
2     3   666

# Verificar valores nulos

In [21]:
df['colnan'] = [np.nan, np.nan, np.nan, np.nan]
df

   col1  col2  colnan
0     1   444     NaN
3     4   444     NaN
1     2   555     NaN
2     3   666     NaN

In [22]:
df.isnull()

    col1   col2  colnan
0  False  False    True
3  False  False    True
1  False  False    True
2  False  False    True

# Removendo valores null

In [25]:
df.dropna(axis = 1, inplace = True)
df

   col1  col2
0     1   444
3     4   444
1     2   555
2     3   666

# Trabalhando com tabela dinamica

In [26]:
df2 = pd.DataFrame(data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] ,
                           'B': ['one', 'one', 'two', 'two', 'one', 'one'] ,
                           'C': ['x', 'y', 'x', 'y', 'x', 'y'],
                           'D': [1, 3, 2, 5, 4, 1]})
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [27]:
df2.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN